# 算数运算符
# + 加法
# - 减法
# * 乘法
# / 除法
# // 取整除
# % 取余
# ** 幂运算 优先级最高

# 赋值运算符
# = 赋值
# += 加法赋值
# -= 减法赋值 
# *= 乘法赋值
# /= 除法赋值
# //= 取整除赋值
# %= 取余赋值
# **= 幂赋值

# 逻辑运算符
# and 逻辑与
# or 逻辑或
# not 逻辑非
# 优先级从高到低依次为：** > * / // % > + - > not > and > or

# 位运算符
# & 按位与
# | 按位或
# ^ 按位异或
# ~ 按位取反 一元运算符
# << 左移
# >> 右移
# 位运算符的优先级低于算数运算符
# 赋值运算符的优先级最低
# 逻辑运算符的优先级低于位运算符

# 成员运算符
# in 成员运算符 在指定的序列中找到值返回True，否则False
# not in 非成员运算符 在指定的序列中没有找到值返回True，否则False

# 身份运算符
# is 身份运算符 判断两个变量是否指向同一个对象
# is not 非身份运算符 判断两个变量是否指向不同的对象


#  一元运算符
# + 一元加法
# - 一元减法
# ~ 一元按位取反